hathach/tinyusb/hw/bsp/kinetis_k/family.c
/*
 * The MIT License (MIT)
 *
 * Copyright (c) 2018, hathach (tinyusb.org)
 * Copyright (c) 2020, Koji Kitayama
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

/* metadata:
   manufacturer: NXP
*/

#include "bsp/board_api.h"
#include "board.h"
#include "fsl_device_registers.h"
#include "fsl_gpio.h"
#include "fsl_port.h"
#include "fsl_clock.h"
#include "fsl_uart.h"
#include "fsl_sysmpu.h"
#include "common/tusb_fifo.h"

#include "board/clock_config.h"
#include "board/pin_mux.h"

#ifdef UART_DEV
// RX ring buffer filled by the RDRF interrupt so board_uart_read() is non-blocking
// and does not drop bytes to UART overrun (see stm32 family for reference).
static uint8_t   uart_rx_ff_buf[32];
static tu_fifo_t uart_rx_ff;

void UART0_RX_TX_IRQHandler(void) {
  if (UART_DEV->S1 & UART_S1_RDRF_MASK) {
    uint8_t byte = UART_DEV->D; // reading S1 then D clears RDRF (and any overrun)
    tu_fifo_write(&uart_rx_ff, &byte);
  }
}
#endif

//--------------------------------------------------------------------+
// Forward USB interrupt events to TinyUSB IRQ Handler
//--------------------------------------------------------------------+
void USB0_IRQHandler(void) {
#if CFG_TUH_ENABLED
  tuh_int_handler(0);
#endif
#if CFG_TUD_ENABLED
  tud_int_handler(0);
#endif
}

void board_init(void) {
  BOARD_InitBootPins();
  BOARD_BootClockRUN();
  SystemCoreClockUpdate();
  SYSMPU_Enable(SYSMPU, 0);

#if CFG_TUSB_OS == OPT_OS_NONE
  // 1ms tick timer
  SysTick_Config(SystemCoreClock / 1000);
#elif CFG_TUSB_OS == OPT_OS_FREERTOS
  // Explicitly disable systick to prevent its ISR from running before scheduler start
  SysTick->CTRL &= ~1U;
  // If freeRTOS is used, IRQ priority is limit by max syscall ( smaller is higher )
  NVIC_SetPriority(USB0_IRQn, configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY );
#endif

  // LED
  gpio_pin_config_t led_config = { kGPIO_DigitalOutput, 0 };
  GPIO_PinInit(LED_PORT, LED_PIN, &led_config);
  board_led_write(false);

#if defined(BUTTON_PORT) && defined(BUTTON_PIN)
  gpio_pin_config_t button_config = { kGPIO_DigitalInput, 0 };
  GPIO_PinInit(BUTTON_PORT, BUTTON_PIN, &button_config);
#endif

#ifdef UART_DEV
  const uart_config_t uart_config = {
      .baudRate_Bps = 115200UL,
      .parityMode = kUART_ParityDisabled,
      .stopBitCount = kUART_OneStopBit,
      .txFifoWatermark = 0U,
      .rxFifoWatermark = 1U,
      .idleType = kUART_IdleTypeStartBit,
      .enableTx = true,
      .enableRx = true
  };
  UART_Init(UART_DEV, &uart_config, UART_CLOCK);
  tu_fifo_config(&uart_rx_ff, uart_rx_ff_buf, sizeof(uart_rx_ff_buf), false);
  UART_DEV->C2 |= UART_C2_RIE_MASK; // enable RX data register full interrupt
  NVIC_EnableIRQ(UART0_RX_TX_IRQn);
#endif

  // USB
  // USB clock is configured in BOARD_BootClockRUN()
}

//--------------------------------------------------------------------+
// Board porting API
//--------------------------------------------------------------------+

void board_led_write(bool state) {
  GPIO_PinWrite(LED_PORT, LED_PIN, state ? LED_STATE_ON : (1 - LED_STATE_ON));
}

uint32_t board_button_read(void) {
#if defined(BUTTON_PORT) && defined(BUTTON_PIN)
  return BUTTON_STATE_ACTIVE == GPIO_PinRead(BUTTON_PORT, BUTTON_PIN);
#else
  return 0;
#endif
}

int board_uart_read(uint8_t *buf, int len) {
#ifdef UART_DEV
  return (int) tu_fifo_read_n(&uart_rx_ff, buf, (uint16_t) len);
#else
  (void) buf;
  (void) len;
  return 0;
#endif
}

int board_uart_write(void const *buf, int len) {
#ifdef UART_DEV
  const uint8_t *p = (const uint8_t *) buf;
  int count = 0;
  while (count < len) {
    if (UART_DEV->S1 & UART_S1_TDRE_MASK) {
      UART_DEV->D = p[count];
      count++;
    } else {
      break;
    }
  }
  return count;
#else
  (void) buf;
  (void) len;
  return -1;
#endif
}

size_t board_get_unique_id(uint8_t id[], size_t max_len) {
  (void) max_len;
  // Kinetis 128-bit Unique Identification Register (SIM->UIDH/UIDMH/UIDML/UIDL)
  uint32_t* id32 = (uint32_t*) (uintptr_t) id;

  id32[0] = SIM->UIDH;
  id32[1] = SIM->UIDMH;
  id32[2] = SIM->UIDML;
  id32[3] = SIM->UIDL;

  return 16;
}

#if CFG_TUSB_OS == OPT_OS_NONE
volatile uint32_t system_ticks = 0;

void SysTick_Handler(void) {
  system_ticks++;
}

uint32_t tusb_time_millis_api(void) {
  return system_ticks;
}
#endif


#ifndef __ICCARM__
// Implement _start() since we use linker flag '-nostartfiles'.
// Requires defined __STARTUP_CLEAR_BSS,
extern int main(void);
TU_ATTR_UNUSED void _start(void) {
  // called by startup code
  main();
  while (1) {}
}

#ifdef __clang__
void	_exit (int __status) {
  (void) __status;
  while (1) {}
}
#endif

#endif
